# Importar Pandas
## sqlite3...   interfaz python para Sqlite

In [2]:
# Importar Pandas
## sqlite3...   interfaz python para Sqlite

import pandas as pd
pd.set_option('display.max_columns',100)
pd.set_option('display.max_rows',100)
import sqlite3
print('complete...')

complete...

# Conectamos con la base de datos "PIZZA"
y se crea un "cursor"... clase necesaria para introducir Instrucciones SQL

In [3]:
try:
    conn = sqlite3.connect('pizza.db') # # Creates connection to existing db or creates an empty db
    print('Connected successfully...')  
except Exception as e:
    print('Error during connection:', str(e))
else: 
    c = conn.cursor() # # Cursor allows SQL commands to be executed.

Connected successfully...

# CREATE TABLE RUNNERS

In [4]:
c.execute( '''
DROP TABLE IF EXISTS runners;
''')
c.execute( '''

CREATE TABLE runners (
  "runner_id" INTEGER,
  "registration_date" DATE
);

''')
c.execute( '''
        INSERT INTO runners
  ("runner_id", "registration_date")
VALUES
  (1, '2021-01-01'),
  (2, '2021-01-03'),
  (3, '2021-01-08'),
  (4, '2021-01-15');
        ''')

# Create Customer Orders

In [5]:
c.execute('''
DROP TABLE IF EXISTS customer_orders;
''')

c.execute( '''CREATE TABLE customer_orders (
  "order_id" INTEGER,
  "customer_id" INTEGER,
  "pizza_id" INTEGER,
  "exclusions" VARCHAR(4),
  "extras" VARCHAR(4),
  "order_time" TIMESTAMP
);

        ''')

c.execute( '''INSERT INTO customer_orders
  ("order_id", "customer_id", "pizza_id", "exclusions", "extras", "order_time")
VALUES
  ('1', '101', '1', '', '', '2020-01-01 18:05:02'),
  ('2', '101', '1', '', '', '2020-01-01 19:00:52'),
  ('3', '102', '1', '', '', '2020-01-02 23:51:23'),
  ('3', '102', '2', '', NULL, '2020-01-02 23:51:23'),
  ('4', '103', '1', '4', '', '2020-01-04 13:23:46'),
  ('4', '103', '1', '4', '', '2020-01-04 13:23:46'),
  ('4', '103', '2', '4', '', '2020-01-04 13:23:46'),
  ('5', '104', '1', 'null', '1', '2020-01-08 21:00:29'),
  ('6', '101', '2', 'null', 'null', '2020-01-08 21:03:13'),
  ('7', '105', '2', 'null', '1', '2020-01-08 21:20:29'),
  ('8', '102', '1', 'null', 'null', '2020-01-09 23:54:33'),
  ('9', '103', '1', '4', '1, 5', '2020-01-10 11:22:59'),
  ('10', '104', '1', 'null', 'null', '2020-01-11 18:34:49'),
  ('10', '104', '1', '2, 6', '1, 4', '2020-01-11 18:34:49');
        ''')

# Create Runner Orders

In [6]:
c.execute( '''
DROP TABLE IF EXISTS runner_orders;
''')

c.execute( '''CREATE TABLE runner_orders (
  "order_id" INTEGER,
  "runner_id" INTEGER,
  "pickup_time" VARCHAR(19),
  "distance" VARCHAR(7),
  "duration" VARCHAR(10),
  "cancellation" VARCHAR(23)
);
        ''')

c.execute( '''INSERT INTO runner_orders
  ("order_id", "runner_id", "pickup_time", "distance", "duration", "cancellation")
VALUES
  ('1', '1', '2020-01-01 18:15:34', '20km', '32 minutes', ''),
  ('2', '1', '2020-01-01 19:10:54', '20km', '27 minutes', ''),
  ('3', '1', '2020-01-03 00:12:37', '13.4km', '20 mins', NULL),
  ('4', '2', '2020-01-04 13:53:03', '23.4', '40', NULL),
  ('5', '3', '2020-01-08 21:10:57', '10', '15', NULL),
  ('6', '3', 'null', 'null', 'null', 'Restaurant Cancellation'),
  ('7', '2', '2020-01-08 21:30:45', '25km', '25mins', 'null'),
  ('8', '2', '2020-01-10 00:15:02', '23.4 km', '15 minute', 'null'),
  ('9', '2', 'null', 'null', 'null', 'Customer Cancellation'),
  ('10', '1', '2020-01-11 18:50:20', '10km', '10minutes', 'null');
        ''')

In [7]:
c.execute( '''
DROP TABLE IF EXISTS pizza_recipes;
''')

c.execute( '''
CREATE TABLE pizza_recipes (
  "pizza_id" INTEGER,
  "toppings" TEXT
);

        ''')

c.execute( '''
INSERT INTO pizza_recipes
  ("pizza_id", "toppings")
VALUES
  (1, '1, 2, 3, 4, 5, 6, 8, 10'),
  (2, '4, 6, 7, 9, 11, 12');
        ''')

# Pizza Names

In [8]:
c.execute( '''
DROP TABLE IF EXISTS pizza_names;
''')

c.execute( '''CREATE TABLE pizza_names (
  "pizza_id" INTEGER,
  "pizza_name" TEXT
);
        ''')

c.execute( '''
INSERT INTO pizza_names
  ("pizza_id", "pizza_name")
VALUES
  (1, 'Meatlovers'),
  (2, 'Vegetarian');
        ''')

# Pizza Toppings

In [9]:
c.execute( '''
DROP TABLE IF EXISTS pizza_toppings;
''')

c.execute( '''
CREATE TABLE pizza_toppings (
  "topping_id" INTEGER,
  "topping_name" TEXT
);
        ''')

c.execute( '''
INSERT INTO pizza_toppings
  ("topping_id", "topping_name")
VALUES
  (1, 'Bacon'),
  (2, 'BBQ Sauce'),
  (3, 'Beef'),
  (4, 'Cheese'),
  (5, 'Chicken'),
  (6, 'Mushrooms'),
  (7, 'Onions'),
  (8, 'Pepperoni'),
  (9, 'Peppers'),
  (10, 'Salami'),
  (11, 'Tomatoes'),
  (12, 'Tomato Sauce');
        ''')

In [10]:
conn.commit()
print('complete...')

complete...

In [11]:
# Example using pandas read_sql
runners_df = pd.read_sql('''
SELECT * FROM runners''', conn)
runners_df

   runner_id registration_date
0          1        2021-01-01
1          2        2021-01-03
2          3        2021-01-08
3          4        2021-01-15

In [ ]:
runners_df.to_excel("output.xls")

In [ ]:
df=pd.read_excel("output.xls")

In [ ]:
df


# /* --------------------
#   Case Study Questions
#   --------------------*/
A. Pizza Metrics

    How many pizzas were ordered?
    How many unique customer orders were made?
    How many successful orders were delivered by each runner?
    How many of each type of pizza was delivered?
    How many Vegetarian and Meatlovers were ordered by each customer?
    What was the maximum number of pizzas delivered in a single order?
    For each customer, how many delivered pizzas had at least 1 change and how many had no changes?
    How many pizzas were delivered that had both exclusions and extras?
    What was the total volume of pizzas ordered for each hour of the day?
    What was the volume of orders for each day of the week?

B. Runner and Customer Experience

    How many runners signed up for each 1 week period? (i.e. week starts 2021-01-01)
    What was the average time in minutes it took for each runner to arrive at the Pizza Runner HQ to pickup the order?
    Is there any relationship between the number of pizzas and how long the order takes to prepare?
    What was the average distance travelled for each customer?
    What was the difference between the longest and shortest delivery times for all orders?
    What was the average speed for each runner for each delivery and do you notice any trend for these values?
    What is the successful delivery percentage for each runner?

C. Ingredient Optimisation

    What are the standard ingredients for each pizza?
    What was the most commonly added extra?
    What was the most common exclusion?
    Generate an order item for each record in the customers_orders table in the format of one of the following:
        Meat Lovers
        Meat Lovers - Exclude Beef
        Meat Lovers - Extra Bacon
        Meat Lovers - Exclude Cheese, Bacon - Extra Mushroom, Peppers
    Generate an alphabetically ordered comma separated ingredient list for each pizza order from the customer_orders table and add a 2x in front of any relevant ingredients
        For example: "Meat Lovers: 2xBacon, Beef, ... , Salami"
    What is the total quantity of each ingredient used in all delivered pizzas sorted by most frequent first?

D. Pricing and Ratings

    If a Meat Lovers pizza costs $12 and Vegetarian costs $10 and there were no charges for changes - how much money has Pizza Runner made so far if there are no delivery fees?
    What if there was an additional $1 charge for any pizza extras?
        Add cheese is $1 extra
    The Pizza Runner team now wants to add an additional ratings system that allows customers to rate their runner, how would you design an additional table for this new dataset - generate a schema for this new table and insert your own data for ratings for each successful customer order between 1 to 5.
    Using your newly generated table - can you join all of the information together to form a table which has the following information for successful deliveries?
        customer_id
        order_id
        runner_id
        rating
        order_time
        pickup_time
        Time between order and pickup
        Delivery duration
        Average speed
        Total number of pizzas
    If a Meat Lovers pizza was $12 and Vegetarian $10 fixed prices with no cost for extras and each runner is paid $0.30 per kilometre traveled - how much money does Pizza Runner have left over after these deliveries?

In [15]:
# Showing all the tables in the dataset
pd.read_sql('''
     SELECT name FROM sqlite_master WHERE type='table';
''', conn)

                   name
0      delivered_orders
1  customer_orders_temp
2               runners
3       customer_orders
4         runner_orders
5         pizza_recipes
6           pizza_names
7        pizza_toppings

# Orders
The exclusions and extras columns will need to be cleaned up before using them in your queries.

In [16]:
pd.read_sql("SELECT *  FROM customer_orders;", conn)

    order_id  customer_id  pizza_id exclusions extras           order_time
0          1          101         1                    2020-01-01 18:05:02
1          2          101         1                    2020-01-01 19:00:52
2          3          102         1                    2020-01-02 23:51:23
3          3          102         2              None  2020-01-02 23:51:23
4          4          103         1          4         2020-01-04 13:23:46
5          4          103         1          4         2020-01-04 13:23:46
6          4          103         2          4         2020-01-04 13:23:46
7          5          104         1       null      1  2020-01-08 21:00:29
8          6          101         2       null   null  2020-01-08 21:03:13
9          7          105         2       null      1  2020-01-08 21:20:29
10         8          102         1       null   null  2020-01-09 23:54:33
11         9          103         1          4   1, 5  2020-01-10 11:22:59
12        10          104         1       null   null  2020-01-11 18:34:49
13        10          104         1       2, 6   1, 4  2020-01-11 18:34:49

### How many pizzas were ordered?

In [22]:
first_q = pd.read_sql('''
 SELECT COUNT(pizza_id) AS ordered_pizza FROM customer_orders_temp;
''', conn)
first_q

   ordered_pizza
0             14

### How many unique customer orders were made?

In [23]:
second_q = pd.read_sql('''
 SELECT COUNT(DISTINCT(order_id)) AS unique_customer FROM customer_orders;
''', conn)
second_q

   unique_customer
0               10

### How many successful orders were delivered by each runner?

In [24]:
third_q = pd.read_sql('''
     SELECT runner_id, COUNT(runner_id) AS order_count
     FROM runner_orders
     WHERE DISTANCE IS NOT NULL -- Iteramos sobre todas las lineas donde distance NO está vacío
     GROUP BY runner_id 
     ORDER BY order_count DESC;
''', conn)


third_q

   runner_id  order_count
0          2            4
1          1            4
2          3            2

### How many of each type of pizza was delivered?

In [28]:
fourth_q = pd.read_sql('''
     SELECT pizza_name, COUNT(pizza_id), pizza_id
     FROM runner_orders
     JOIN customer_orders
     USING (order_id)
     JOIN pizza_names
     using (pizza_id)
     WHERE DISTANCE IS NOT NULL
     GROUP BY pizza_name;
                       ''', conn)
fourth_q

   pizza_name  COUNT(pizza_id)  pizza_id
0  Meatlovers               10         1
1  Vegetarian                4         2

### How many Vegetarian and Meatlovers were ordered by each customer?

In [43]:
fifth_q = pd.read_sql('''
     SELECT customer_id, COUNT(pizza_id), pizza_name FROM customer_orders
     JOIN pizza_names USING (pizza_id)
     GROUP BY customer_id;
            ''', conn)
fifth_q

   customer_id  COUNT(pizza_id)  pizza_name
0          101                3  Meatlovers
1          102                3  Meatlovers
2          103                4  Meatlovers
3          104                3  Meatlovers
4          105                1  Vegetarian

### What was the maximum number of pizzas delivered in a single order?

In [ ]:
sixth_q = pd.read_sql('''
     SELECT * 
                      ''')

In [ ]:
# For each customer, how many delivered pizzas had at least 1 change and how many had no changes?

In [ ]:
# How many pizzas were delivered that had both exclusions and extras?

In [ ]:
# What was the total volume of pizzas ordered for each hour of the day?

In [ ]:
# What was the volume of orders for each day of the week?

# CLEANUP
Using  
WHEN
AS
CASE
SQL keywords

In [15]:
c.execute( '''
DROP TABLE IF EXISTS customer_orders_temp;

''')


c.execute( '''
CREATE TABLE customer_orders_temp AS
  SELECT 
    order_id, 
    customer_id, 
    pizza_id, 
    CASE
      WHEN exclusions = 'null'  OR  exclusions is null THEN ''
      ELSE exclusions
    END AS exclusions,
    
    CASE
      WHEN extras = 'null'  OR  extras is null THEN ''
      ELSE extras
    END AS extras,
    
    
    order_time

FROM customer_orders;
        ''')